IDEA Open Model
CrossSectionFactory.FillSteelTube Method
Compatible with IDEA StatiCa 20.1
 Fill steel tube
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillSteelTube(
	CrossSectionParameter cssO,
	double r,
	double t
)
Public Shared Sub FillSteelTube (
	cssO As CrossSectionParameter,
	r As Double,
	t As Double
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
r
Type: System.Double
The radius of circle.
t
Type: System.Double
The thickness of wall.
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace